onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дораб_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Дораб_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Дораб_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Начало доработки 
	//Левандовский А.Н. 
	//Добавление "ГруппаКнопкаИСкидка"
	   	Группа = Элементы.Добавить("ГруппаКнопкаИСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = ЛОЖЬ;
	//Конц доработки
	
	//Начало доработки 
	//Левандовский А.Н. 
	//Добавление поля ввода "Дораб_КонтактноеЛицо"
	Если Элементы.Найти("Дораб_КонтактноеЛицо") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("Дораб_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
		НовыйЭлемент.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Контактное лицо";
	КонецЕсли;	
	//Конец доработки
	
	//Начало доработки 
	//Левандовский А.Н. 
	//Добавление поля ввода "Дораб_СогласованнаяСкидка"
	Если Элементы.Найти("Дораб_СогласованнаяСкидка") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("Дораб_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаКнопкаИСкидка);
		НовыйЭлемент.ПутьКДанным = "Объект.Дораб_СогласованнаяСкидка";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Согласованная скидка";
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Дораб_СогласованнаяСкидкаПриИзмененииВопрос");
	КонецЕсли;	
	//Конец доработки
	
	//Начало доработки 
	//Левандовский А.Н.
	//Добавление команды "Пересчитать скидку"
	Команда = Команды.Добавить("ПересчитатьСкидку");
	Команда.Заголовок = "Пересчитать скидку";
	Команда.Действие = "Дораб_СогласованнаяСкидкаПриИзменении";
	
	КнопкаФормы = Элементы.Добавить("КнопкаПересчитатьСкидку", Тип("КнопкаФормы"), Элементы.ГруппаКнопкаИСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьСкидку";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//Конец доработки
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//Начало доработки
	//Левандовский А.Н.
	//Добавление расчета скидки
    //Исходный код:
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	//
	//Новый код:
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * (ТекущиеДанные.Цена - (ТекущиеДанные.Цена * (Объект.Дораб_СогласованнаяСкидка + ТекущиеДанные.Скидка) / 100));
	
	СуммаСкидок = 0;
	СуммаСкидок = СуммаСкидок + ТекущиеДанные.Скидка;
	СуммаСкидокОбщая = СуммаСкидок + Объект.Дораб_СогласованнаяСкидка;
	
	Если СуммаСкидокОбщая > 100 Тогда
        Сообщить("Общая сумма скидок не может быть больше 100.");
		ТекущиеДанные.Сумма = 0;
		Объект.СуммаДокумента = 0;
		Возврат;
    КонецЕсли;
	//Конец доработки
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура Дораб_СогласованнаяСкидкаПриИзменении()
	
	//Начало доработки 
	//Левандовский А.Н. 
	//Расчет скидки при изменении 
	Дораб_ПроверкаОбщейСкидки();
	//Конец доработки
	
КонецПроцедуры

&НаСервере
Процедура Дораб_ПроверкаОбщейСкидки()
	
	//Начало доработки 
	//Левандовский А.Н. 
	//Код расчета скидки при изменении 
	СуммаСкидок = 0; 
	
	Для Каждого Строка Из Объект.Товары Цикл
		СуммаСкидок = СуммаСкидок + Строка.Скидка;
		СуммаСкидокОбщая = СуммаСкидок + Объект.Дораб_СогласованнаяСкидка;
		Строка.Сумма = Строка.Количество * (Строка.Цена - (Строка.Цена * СуммаСкидокОбщая / 100));
		
		Если СуммаСкидокОбщая > 100 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Общая сумма скидок не может быть больше 100.";
			Сообщение.Сообщить();
			Строка.Сумма = 0;
			Объект.СуммаДокумента = 0;
			Возврат
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Услуги Цикл
		СуммаСкидок = СуммаСкидок + Строка.Скидка;
		СуммаСкидокОбщая = СуммаСкидок + Объект.Дораб_СогласованнаяСкидка;
		Строка.Сумма = Строка.Количество * (Строка.Цена - (Строка.Цена * СуммаСкидокОбщая / 100));
		
		Если СуммаСкидокОбщая > 100 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Общая сумма скидок не может быть больше 100.";
			Сообщение.Сообщить();
			Строка.Сумма = 0;
			Объект.СуммаДокумента = 0;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
    //Конец доработки

КонецПроцедуры

&НаКлиенте
Асинх Процедура Дораб_СогласованнаяСкидкаПриИзмененииВопрос(Элемент)
	
	//Начало доработки 
	//Левандовский А.Н.
	//Добавленик вопроса и  расчета скидки 
	Если Объект.Товары.Количество() ИЛИ Объект.Услуги.Количество() > 0 Тогда
		Ответ = Ждать ВопросАсинх("Пересчитать табличную часть с учетом новой скидки?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Дораб_ПроверкаОбщейСкидки();
		КонецЕсли;
	КонецЕсли;
	//Конец доработки
	
КонецПроцедуры


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
